messages_ru = {
    'existing_user': "Регистрация пройдена. Рад видеть тебя снова!\nИспользуй команду /mood, чтобы ввести своё настроение сегодня.\nИспользуй команду /help, чтобы увидеть другие функции.",
    'start': "Привет! Я - Heymood бот.\nМоя цель - помочь тебе отслеживать своё настроение. Также здесь ты можешь получить информацию о погоде. В будущем появятся и другие полезные возможности.",
    'help': """
        Доступные команды:
        /start - Приветствие и описание бота
        /mood - Ввести данные о своём настроении
        /weather - Получить данные о погоде в вашем регионе
        /me - Получить информацию о себе
        /help - Описание доступных команд
        """,
    'sex_ask': "Выбери свой пол.\nЭто поможет мне собирать статистику. Все данные останутся конфиденциальными и будут использованы только для внутреннего анализа:",
    'age_ask': "Пожалуйста, введи свой возраст числом (например, 30):",
    'age_ask_again': "Пожалуйста, введи свой возраст числом.",
    'success_save': "Отлично! Используй команду /help, чтобы увидеть доступные команды.",
    'no_saved_info': "Информация о тебе еще не была сохранена.",
    'about_me': "Пол: {sex}\nВозраст: {age}\nЭти данные используются только для статистического анализа и остаются конфиденциальными.",
    'start_weather': "Введи название города на русском или английском языке, чтобы получить данные о погоде (например, Сан-Франциско или New York).",
    'get_weather': "Текущая погода в {city_name}:\nТемпература: {temperature}°C\nВлажность: {humidity}%\nСкорость ветра: {wind_speed} м/с\nВидимость: {visibility} м\nДавление: {pressure} гПа\nОписание: {description}",
    'no_weather': "Данные о погоде не получены. Пожалуйста, используй /weather снова и введи название города.",
    'select_mood': "Оцени своё текущее настроение от 1 до 10, чтобы я мог отслеживать его динамику. Если настроение изменится, используй команду /mood снова, чтобы обновить его.",
    'saved_mood': "Настроение сохранено! Спасибо за ответ.\nОтмечай своё настроение каждый день, чтобы я мог анализировать его динамику.",
    'low_mood_advice': "Твоё настроение сегодня на низком уровне. Вот несколько советов, которые могут помочь:\n\n1. Проведи время на свежем воздухе. Прогулка поможет улучшить твоё настроение и снять стресс.\n2. Обратись к друзьям или близким. Поддержка и понимание со стороны близких людей помогают в трудные моменты.\n3. Практикуй глубокое дыхание или медитацию. Эти техники успокаивают ум и уменьшают тревожность.",
    'medium_mood_advice': "Твоё настроение сегодня на среднем уровне. Вот несколько советов, которые могут помочь поддержать его и улучшить:\n\n1. Найди время для своих хобби или занятий. Это поможет тебе расслабиться и отвлечься от повседневных забот.\n2. Проведи время с друзьями или близкими. Общение с любимыми людьми может приносить радость и улучшать настроение.\n3. Займись физической активностью. Спорт улучшает настроение и здоровье.",
    'high_mood_advice': "Твоё настроение сегодня отличное! Вот несколько советов, которые помогут тебе его поддержать и наслаждаться жизнью:\n\n1. Продолжай делать то, что приносит тебе радость и удовлетворение. Это может быть чтение любимой книги, занятие хобби или просто прогулка на свежем воздухе.\n2. Поддерживай положительные отношения с окружающими. Общение с друзьями и семьёй помогает укрепить связи и создать поддерживающую среду.\n3. Не забывай поощрять себя за достижения и маленькие победы. Признание своих успехов и ценность своих усилий важно для самооценки и уверенности в себе.",
}
